---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Macros.DocumentEntryPoint
source: html/83a4ea40-435c-142c-ef1e-1f49b6b60a5c.htm
---
# DocumentEntryPoint Members

Initializes a new instance of the DocumentEntryPoint class